# EDA
- This notebook conducts exploratory data analysis using SQL

In [7]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

In [8]:
%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%%sql
-- test query
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(19413262, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 30, 17, 19, 3), datetime.datetime(2019, 7, 30, 17, 19, 22), datetime.datetime(2019, 7, 30, 17, 27, 8), datetime.datetime(2019, 7, 30, 17, 55, 39), 233, 48, 2.82, 1710, 23.5, 0.0, 0.0, 2.04, 2.75, None, 0.0, 17.2, 'N', 'N', ' ', 'N', 'N'),
 (10669053, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 18, 7, 40, 3), datetime.datetime(2019, 7, 18, 7, 42, 52), datetime.datetime(2019, 7, 18, 7, 43, 40), datetime.datetime(2019, 7, 18, 7, 55, 11), 224, 233, 2.35, 691, 4.36, 0.0, 0.0, 0.39, 0.75, None, 1.0, 5.48, 'Y', 'Y', ' ', 'N', ' '),
 (5101164, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 7, 9, 21, 37, 27), datetime.datetime(2019, 7, 9, 21, 42, 52), datetime.datetime(2019, 7, 9, 21, 46, 5), datetime.datetime(2019, 7, 9, 22, 28, 34), 124, 7, 17.76, 2549, 22.1, 0.0, 0.0, 1.91, 0.0, None, 0.0, 30.36, 'Y', 'Y', ' ', 'N', ' '),
 (1310001, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 7, 3, 10, 10, 33), datetime.datetime(2019, 7, 3, 10, 10, 44), datetime.datetime(2019, 7, 3, 10, 12, 56), datetime.datetime(2019, 7, 3, 10, 38, 18), 162, 138, 9.06, 1522, 32.86, 6.12, 0.0, 3.38, 2.75, None, 0.0, 28.6, 'N', 'N', ' ', 'N', ' '),
 (9802365, 'HV0003', 'B02869', 'B02869', datetime.datetime(2019, 7, 16, 21, 25, 1), datetime.datetime(2019, 7, 16, 21, 27, 25), datetime.datetime(2019, 7, 16, 21, 28, 43), datetime.datetime(2019, 7, 16, 21, 37, 1), 198, 226, 2.3, 498, 9.64, 0.0, 0.0, 0.84, 0.0, None, 0.0, 6.63, 'N', 'N', ' ', 'N', ' '),
 (17509961, 'HV0003', 'B02617', 'B02617', datetime.datetime(2019, 7, 27, 19, 25, 49), datetime.datetime(2019, 7, 27, 19, 27, 37), datetime.datetime(2019, 7, 27, 19, 28, 27), datetime.datetime(2019, 7, 27, 19, 56, 38), 231, 100, 2.78, 1692, 14.49, 0.0, 0.0, 1.32, 2.75, None, 0.0, 17.0, 'N', 'N', ' ', 'N', 'N'),
 (10057147, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 17, 9, 18, 10), None, datetime.datetime(2019, 7, 17, 9, 24, 56), datetime.datetime(2019, 7, 17, 9, 36, 59), 55, 108, 0.602, 723, 6.84, 0.0, 0.17, 0.61, 0.0, None, 0.0, 6.63, 'N', 'N', 'N', 'N', 'N'),
 (4117356, 'HV0003', 'B02888', 'B02888', datetime.datetime(2019, 7, 8, 4, 13, 28), datetime.datetime(2019, 7, 8, 4, 18, 2), datetime.datetime(2019, 7, 8, 4, 19, 16), datetime.datetime(2019, 7, 8, 4, 30, 15), 42, 169, 3.9, 658, 15.88, 0.0, 0.0, 1.37, 0.0, None, 0.0, 9.7, 'N', 'N', ' ', 'N', ' '),
 (16375661, 'HV0003', 'B02867', 'B02867', datetime.datetime(2019, 7, 26, 9, 15, 7), datetime.datetime(2019, 7, 26, 9, 22, 45), datetime.datetime(2019, 7, 26, 9, 24), datetime.datetime(2019, 7, 26, 9, 47, 56), 79, 170, 2.34, 1436, 8.32, 0.0, 0.0, 0.72, 0.75, None, 0.0, 12.11, 'Y', 'Y', ' ', 'N', 'N'),
 (13740874, 'HV0004', 'B02800', None, datetime.datetime(2019, 7, 22, 8, 43, 13), None, datetime.datetime(2019, 7, 22, 8, 56, 49), datetime.datetime(2019, 7, 22, 9, 8, 45), 24, 42, 1.7, 716, 6.75, 0.0, 0.0, 0.6, 0.0, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N')]

In [10]:
%%sql
-- test query
SELECT * FROM zones LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(0, 1, 'EWR', 'Newark Airport', 'EWR'),
 (1, 2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (2, 3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (3, 4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (4, 5, 'Staten Island', 'Arden Heights', 'Boro Zone'),
 (5, 6, 'Staten Island', 'Arrochar/Fort Wadsworth', 'Boro Zone'),
 (6, 7, 'Queens', 'Astoria', 'Boro Zone'),
 (7, 8, 'Queens', 'Astoria Park', 'Boro Zone'),
 (8, 9, 'Queens', 'Auburndale', 'Boro Zone'),
 (9, 10, 'Queens', 'Baisley Park', 'Boro Zone')]

In [11]:
%%sql
-- min and max request dates
SELECT
MIN(request_datetime) min_request, 
MAX(request_datetime) max_request
FROM main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 6, 30, 23, 53, 32), datetime.datetime(2019, 7, 31, 23, 58, 17))]

In [12]:
%%sql
-- min and max pickup dates
SELECT
MIN(pickup_datetime) min_pickup, 
MAX(pickup_datetime) max_pickup
FROM main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 7, 1, 0, 0, 26), datetime.datetime(2019, 7, 31, 23, 59, 43))]

### Fares

In [13]:
%%sql
-- Min/max for fare
-- we can see that a negative base fare exists
SELECT
MIN(base_passenger_fare) min_fare, 
MAX(base_passenger_fare) max_fare
FROM main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(-62.69, 627.65)]

In [14]:
%%sql
-- How many rides have a negative fare?
-- Less than 1% of rides have a negative base fare
-- possibly accounts for refunds?
SELECT 
ROUND(100 * SUM((base_passenger_fare < 0)::int)::numeric
/ (SELECT COUNT(*) FROM main), 2) "Percent Negative Fares"
FROM main
LIMIT 10

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('0.39'),)]

### Trip Miles

In [15]:
%%sql
-- Min/max for miles
-- We can see a 'zero miles' trip exists
SELECT
MIN(trip_miles) min_miles, 
MAX(trip_miles) max_miles
FROM main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(0.0, 220.21)]

### Trip Time

In [16]:
%%sql
-- Are these trips an anomaly?
-- The base fare is positive which suggests these are brief but real rides
SELECT
trip_miles,
base_passenger_fare,
trip_time/60 "Trip time (minutes)"
FROM main
WHERE trip_miles = (SELECT MIN(trip_miles) FROM main);

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[(0.0, 7.37, 2),
 (0.0, 4.6, 0),
 (0.0, 7.59, 11),
 (0.0, 11.0, 37),
 (0.0, 2.84, 0),
 (0.0, -4.8, 0),
 (0.0, 5.38, 2),
 (0.0, 8.49, 18),
 (0.0, 0.0, 0),
 (0.0, 14.56, 4),
 (0.0, 6.6, 9),
 (0.0, 0.0, 0),
 (0.0, 5.52, 5),
 (0.0, 6.75, 29),
 (0.0, 6.46, 3),
 (0.0, 28.23, 31),
 (0.0, 12.05, 2),
 (0.0, 7.37, 0),
 (0.0, 6.95, 13),
 (0.0, 16.65, 2)]

In [17]:
%%sql
-- min/max trip tipe in minutes
SELECT 
min(trip_time) / 60 "Min Trip Time (Minutes)",
max(trip_time) / 60 "Max Trip Time (Minutes)"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(0, 557)]

### Driver Pay

In [18]:
%%sql
-- min/max pay of zero
-- possibly due to refund / cancelled rides?
SELECT 
MIN(driver_pay) min_pay, 
MAX(driver_pay) max_pay
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(0.0, 527.43)]

In [19]:
%%sql
-- Percent with no pay
SELECT 
ROUND(
100 * AVG(( -- take average to get percent of rides there this is the case
    driver_pay = (SELECT MIN(driver_pay) FROM main) -- indicator: driver pay equals the minimum pay (zero)
)::int)
, 2) "Percent No Driver Pay"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('12.93'),)]

### Sharing Rides

In [20]:
%%sql
-- distinct values
SELECT DISTINCT shared_request_flag
FROM main

 * postgresql://root:***@localhost:5432/uber
2 rows affected.

[('Y',), ('N',)]

In [21]:
%%sql
-- Percent that requested share
SELECT 
100 * ROUND(
AVG((shared_request_flag = 'Y')::int)
, 2) "Percent Requested Share"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('21.00'),)]

In [22]:
%%sql
-- but only about 14% actually receive a share
SELECT 
100 * ROUND(
AVG((shared_request_flag = 'Y')::int)
, 2) "Percent Requested Share",
100 * ROUND(
AVG((shared_match_flag = 'Y')::int)
, 2) "Percent Successful Share"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('21.00'), Decimal('13.00'))]

In [23]:
%%sql
-- finding: shared rides are less likely to tip
-- However, could be due to a different average trip time
SELECT 
shared_request_flag, 
ROUND(
    100*AVG((tips > 0)::int)
    , 2) "Percent with Tips",
ROUND(
    AVG(trip_miles)
    , 2) avg_trip
FROM main 
GROUP BY shared_request_flag
ORDER BY AVG((tips>0)::int) DESC

 * postgresql://root:***@localhost:5432/uber
(psycopg2.errors.UndefinedFunction) function round(double precision, integer) does not exist
LINE 8: ROUND(
        ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: -- finding: shared rides are less likely to tip
-- However, could be due to a different average trip time
SELECT
shared_request_flag,
ROUND(
    100*AVG((tips > 0)::int)
    , 2) "Percent with Tips",
ROUND(
    AVG(trip_miles)
    , 2) avg_trip
FROM main
GROUP BY shared_request_flag
ORDER BY AVG((tips>0)::int) DESC]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Wheelchair Rides

In [24]:
%%sql
-- Percent that requested wheelchair
-- very low
SELECT 
100 * ROUND(
AVG((wav_request_flag = 'Y')::int)
, 2) "Percent Requested Wheelchair"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('0.00'),)]

### Tips

In [25]:
%%sql
SELECT 
MIN(tips) min_tips,
MAX(tips) max_tips
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(0.0, 84.27)]

In [26]:
%%sql
SELECT 
ROUND(
    100*AVG((tips > 0)::int)
    , 2) "Percent with Tips"
FROM main

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(Decimal('13.38'),)]

### Tolls

In [63]:
%%sql
SELECT 
ROUND(
    100*AVG((tolls > 0)::int)
    , 2) "Percent with Tolls"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('10.39'),)]